# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 19  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   #[-1, 3, C3, [64]],           # 1-P1/1
   [-1, 1, Conv, [128, 3, 2]],  
   [-1, 3, C3, [128]],          # 3-P2/2
   [-1, 1, Conv, [256, 3, 2]],  
   [-1, 6, C3, [256]],          # 5-P3/4
   [-1, 1, Conv, [512, 3, 2]],  
   [-1, 9, C3, [512]],          # 7-P4/8
   [-1, 1, Conv, [1024, 3, 2]],  
   [-1, 3, C3, [1024]],         # 9-P5/16
   [-1, 1, SPPF, [1024, 5]],    # 10
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 14

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 18 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [128, False]],  # 22 (P3/8-small)

   #[-1, 1, Conv, [128, 1, 1]],
   #[-1, 1, nn.Upsample, [None, 4, 'bilinear']],

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear']],
   #[[-1, 1], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [64, False]],   # 26 (P3/8-small)

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear']],

   #[-1, 1, Conv, [64, 3, 2]],
   #[[-1, 22], 1, Concat, [1]], # cat head P4
   #[-1, 3, C3, [128, False]],  # 29 (P4/16-medium)

   #[-1, 1, Conv, [128, 3, 2]],
   #[[-1, 18], 1, Concat, [1]], # cat head P4
   #[-1, 3, C3, [256, False]],  # 32 (P4/16-medium)

   #[[26, 29, 32], 1, Detect, [nc]],  # Detect(P3, P4, P5)
   [[26], 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ]
